// Задача 1. Дано масив рядкових представлень чисел (тобто масив чисел у лапках (string). З використанням
// перевірки за допомогою регулярних виразів і груп підрахувати кількість тих, у яких перша і остання
// літери однакові.

// let testArr = ['121','232','311','433','155','212','355']

// let count = 0
// for (const el of testArr) {
//     if(el.match(/^(\d{1}).*(\1)$/))
//     count++
// }
// console.log(count);

// Задача 2. Замінити номер розділяючи послідовності цифр дефісом згідно з форматом
// 0 50 45 466 26   🡪  +380-50-45-466-26

// let test = '0504546626'
// let testNumber = /(\d{1})(\d{2})(\d{2})(\d{3})(\d{2})/
// test = test.replace(testNumber, '+38$1-$2-$3-$4-$5')
// console.log(test);

// Задача 3. Після кожного значення року після 2000 року додати «р.»

// let test =  '«Я народився 2000, а в школі пішов 2007»  «Я народився 2001, а в школі пішов 2007»'
// console.log(test.replace(/(20(0[1-9]|[1-9]))/g, '$1р.'))

// Задача 4. Вводиться велике число. Кожні 3 розряди відділяти пробілом.
// 7457896524 🡪 7 457 896 524

// let test = '7457896524'
// console.log(test.replace(/(?=(\d{3})+(?!\d))/g, ' '));
